Repository: paveldevcorporation/ThinkFast
Catalog: ThinkFast/ThinkFast/Resources/AppResources.*.resx
Languages: ru, uk

# Addition1To20Rule
source: Decompose the second term into convenient terms (first add up to a round number, then the remaining part)
ru: Разложи второе слагаемое на удобные слагаемые (сначала добавь до круглого числа, затем оставшуюся часть)
uk: Розклади другий доданок на зручні доданки (спочатку додай до круглого числа, потім решту)

source: Back
ru: Назад
uk: Назад

source: Combo
ru: Комбо
uk: Комбо

source: Division
ru: Деление
uk: Ділення

# Division4Message
source: To divide a number by 4, it is divided twice by 2.
ru: Чтобы разделить число на 4, его дважды делят на 2.
uk: Щоб розділити число на 4, його двічі ділять на 2.

# Division5Message
source: To divide by 5, first multiply by 2, and then divide the result by 10.
ru: Для деления на 5, сначала умножаем на 2, а затем полученное делим на 10.
uk: Для ділення на 5, спочатку множимо на 2, а потім отримане ділимо на 10.

# Division8Message
source: To divide a number by 8, divide it three times by 2.
ru: Чтобы разделить число на 8, его трижды делят на 2.
uk: Щоб розділити число на 8, його тричі ділять на 2.

# DivisionOneMessage
source: To divide by a single-digit number, we divide the original multi-digit number into convenient parts, which will be exactly divisible by a single-digit number.
ru: Для деления на однозначное число разбиваем исходное многозначное число на удобные части, которые точно будут делиться на однозначное.
uk: Для поділу на однозначне число розбиваємо вихідне багатозначне число на зручні частини, які точно будуть ділитися на однозначне.

source: Excellent!
uk: Відмінно!

# Minus
source: Subtraction
ru: Вычитание
uk: Віднімання

# Minus7Message
source: To subtract 7, subtract 10 and add 3.
ru: Чтобы вычесть 7, необходимо вычесть 10 и прибавить 3.
uk: Щоб відняти 7, необхідно відняти 10 і додати 3.

# Minus8Message
source: To subtract 8, subtract 10 and add 2.
ru: Чтобы вычесть 8, необходимо вычесть 10 и прибавить 2.
uk: Щоб відняти 8, необхідно відняти 10 і додати 2.

# Minus9Message
source: To subtract 9, subtract 10 and add 1.
ru: Чтобы вычесть 9, необходимо вычесть 10 и прибавить 1.
uk: Щоб відняти 9, необхідно відняти 10 і додати 1.

# MinusMultiMessage
source: When subtracting multi-digit numbers, you need to divide the number that you subtract into digits.
ru: При вычитании многозначных чисел необходимо разбить на разряды то число, которое вы отнимаете.
uk: При відніманні багатозначних чисел необхідно розбити на розряди то число, яке ви віднімаєте.

source: Multiplication
ru: Умножение
uk: Множення

# Multiplication11Message
source: To multiply any number by 11, you need to multiply this number by 10, and then add the number itself to the result.
ru: Чтобы умножить любое число на 11 необходимо умножить это число на 10, а затем к результату добавить само число.
uk: Щоб помножити будь-яке число на 11 необхідно помножити це число на 10, а потім до результату додати саме число.

# Multiplication25Message
source: To verbally multiply a number by 25, it is multiplied by 100 and divided by 4.
ru: Чтобы устно умножить число на 25, его умножают на 100 и делят на 4.
uk: Щоб усно помножити число на 25, його множать на 100 і ділять на 4.

# Multiplication25_4Message
source: To orally multiply a multiple of 4 by 25, divide it by 4 and multiply it by 100.
ru: Чтобы устно умножить число, кратное 4, на 25, его делят на 4 и умножают на 100.
uk: Щоб усно помножити число, кратне 4, на 25, його ділять на 4 і множать на 100.

# Multiplication4Message
source: Multiply by 4 is to multiply by 2 twice.
ru: Умножить на 4 - это дважды умножить на 2.
uk: Помножити на 4 - це двічі помножити на 2.

# Multiplication5Message
source: To multiply by 5 an odd number, it is multiplied by 10, and then divided by 2.
ru: Для умножения на 5 нечетного числа, его умножают на 10, а потом делят на 2.
uk: Для множення на 5 непарного числа, його множать на 10, а потім ділять на 2.

# Multiplication5_2Message
source: To multiply an even number by 5, divide it by 2 and then multiply by 10.
ru: Для умножения на 5 четного числа, его делят на 2, а потом умножают на 10.
uk: Для множення на 5 парного числа, його ділять на 2, а потім множать на 10.

# Multiplication8Message
source: Multiply by 8 is to multiply by 2 three times.
ru: Умножить на 8 - это трижды умножить на 2.
uk: Помножити на 8 - це тричі помножити на 2.

# Multiplication9Message
source: To multiply any number by 9, you need to multiply this number by 10, and then subtract the number itself from the result.
ru: Чтобы умножить любое число на 9 необходимо умножить это число на 10, а затем вычесть из результата само число.
uk: Щоб помножити будь-яке число на 9 необхідно помножити це число на 10, а потім відняти з результату саме число.

# MultiplicationMultyMessage
source: To multiply multi-digit numbers, you need to mentally break one of these numbers into digits.
ru: Для умножения многозначных чисел необходимо мысленно разбить одно из этих чисел на разряды.
uk: Для множення багатозначних чисел необхідно подумки розбити одне з цих чисел на розряди.

# MultiplicationMultyOneMessage
source: To multiply a multi-digit number by a single-digit number, you need to split the multi-digit number into digits, multiply each by a single-digit number and sum the results.
ru: Для умножения многозначного на однозначное необходимо разбить многозначное число на разряды, перемножить каждый на однозначное число и суммировать результаты.
uk: Для множення багатозначного на однозначне необхідно розбити багатозначне число на розряди, перемножити кожен на однозначне число і підсумувати результати.

source: Play
ru: Играть
uk: Грати

# Plus
source: Addition
ru: Сложение
uk: Складання

# PlusMultiMessage
source: To sum up multi-digit numbers, we divide them into digits (hundreds, tens, ones) and sum them up one by one.
ru: Для cуммирования многозначных чисел, разбиваем их на разряды (сотни, десятки, единицы) и поочередно их суммируем.
uk: Для підсумовування багатозначних чисел, розбиваємо їх на розряди (сотні, десятки, одиниці) і по черзі їх підсумовуємо.

# Plus_7_8_9_Message
source: To simplify the calculations of the numbers 7,8,9, you need to round them up to 10, and then subtract the increase.
ru: Для упрощения вычислений чисел 7,8,9 надо их округлить до 10, а затем вычесть прибавку.
uk: Для спрощення обчислень чисел 7,8,9 треба їх округлити до 10, а потім відняти надбавку.

source: PupsoCount
ru: ПупсоСчёт
uk: ПупсоСчёт

source: Record
ru: Рекорд
uk: Рекорд

source: Repeat
ru: Повтор
uk: Повтор

source: Rules
ru: Правила
uk: Правило

source: Score
ru: Счет
uk: Рахунок

# Subtraction1To20Rule
source: Decompose the subtractible into convenient terms (first subtract such a number so that it turns out to be round, then the remaining part)
ru: Разложи вычитаемое на удобные слагаемые (сначала вычти такое число, чтобы получилось круглое, затем оставшуюся часть)
uk: Розклади віднімається на зручні доданки (спочатку відняти таке число, щоб вийшло кругле, потім частину, що залишилася)
